---
kind: property
id: P:Autodesk.Revit.DB.ImageType.WidthInPixels
source: html/2e5bdc03-43f0-e718-7c7b-75781cdfdb19.htm
---
# Autodesk.Revit.DB.ImageType.WidthInPixels Property

Number of pixels in the horizontal direction of the image

## Syntax (C#)
```csharp
public int WidthInPixels { get; }
```